ben/blog/Book_Group_2025_Lookback.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2025 Book Group: Learning in the Year of AI</title>
<meta name="author" content="Ben" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">2025 Book Group: Learning in the Year of AI</h1>
<p><strong>Tags:</strong> <span class="tags"><a href="tags/book-group.html">book-group</a></span></p>

<p>
This post covers the topics my book group explored in 2025, complete with my notes and reviews. Comprised mostly of former and current co-workers, we are a group of senior engineers and tech enthusiasts who gather monthly to learn something new or debate the merits of a specific topic.
</p>

<p>
While we cover a wide range of subjects, 2025 had an undeniable gravitational center: Artificial Intelligence.
</p>

<p>
Looking back at our schedule, you can see a clear narrative arc mirroring the industry's own struggle with this technology. We started the year with traditional career advice, pivoted hard into the mechanics of "Prompt Engineering" in March, and then spent the subsequent months questioning the value of foundational knowledge in a world of intelligent agents. By the end of the year, even our discussions on software design were filtered through the lens of, "Does this matter if an AI writes the code?"
</p>

<p>
Here is a retrospective of our reading list and how our thinking evolved throughout the year.
</p>
<div id="outline-container-org53680a0" class="outline-3">
<h3 id="org53680a0">Logistics Note</h3>
<div class="outline-text-3" id="text-org53680a0">
<p>
We maintain a backlog of potential topics in a shared doc. When it's time to choose, we vote on a shortlist using a custom implementation of <a href="https://en.wikipedia.org/wiki/Black%27s_method">Black's method</a> (rank-choice voting) [<a href="https://gist.github.com/benprew/4328b6d38c01d7e35bfc77671bda430a">source code</a>].
</p>
</div>
</div>
<div id="outline-container-orgf1e16e2" class="outline-2">
<h2 id="orgf1e16e2"><a href="https://www.amazon.com/Software-Developers-Career-Handbook-Unpredictable/dp/1098116674">February - The Software Developer's Career Handbook: A Guide to Navigating the Unpredictable</a></h2>
<div class="outline-text-2" id="text-orgf1e16e2">
</div>
<div id="outline-container-org4d569fc" class="outline-3">
<h3 id="org4d569fc">Abstract</h3>
<div class="outline-text-3" id="text-org4d569fc">
<p>
Authored by Michael Lopp, also known as <a href="https://randsinrepose.com/">Rands in Repose</a>, this book is a comprehensive guide to managing your career as a software developer, from individual contributor to leadership roles.
</p>
</div>
</div>
<div id="outline-container-org3e61edf" class="outline-3">
<h3 id="org3e61edf">Summary Review</h3>
<div class="outline-text-3" id="text-org3e61edf">
<p>
I found some of the chapters better than others but overall it felt like a collection of blog posts rather than a complete book that had a strong narrative. Part 1 is the strongest part of the book and focuses the most on IC and career development. Part 2 has a mix of good/bad chapters and Parts 3 &amp; 4 feel like a hodgepodge of topics related to generic career advice, management, culture and a little bit of everything in-between.
</p>
</div>
</div>
</div>
<div id="outline-container-org5a7d131" class="outline-2">
<h2 id="org5a7d131">March - AI Prompting Course</h2>
<div class="outline-text-2" id="text-org5a7d131">
</div>
<div id="outline-container-org4c2338c" class="outline-3">
<h3 id="org4c2338c">Summary Review</h3>
<div class="outline-text-3" id="text-org4c2338c">
<p>
A collection of blog posts on how to write better prompts. We had looked at several options and because things were advancing so quicky most of the published books looked out of date. Looking back it's surprising how much the state of the art has advanced from March.
</p>

<p>
We did a lot of reading on prompt construction and the emerging Meta Context Protocol, but I spend very little time "engineering" my prompts or configuring MCP servers to do things. Turns out as the AIs got smarter they could write better code and could use basic unix tools to get most of the work done.
</p>

<p>
Most of these blog posts are outdated now. Prompt engineering has mostly gone away. Writing a good prompt is still important, but requires fewer "tricks". Instead specifying the request clearly and in detail is more important. Agentic tools often have a "plan" then "implement" cycle built into them that highlight areas that need clarification.
</p>

<p>
Highlights:
</p>
<ul class="org-ul">
<li><a href="https://www.oreilly.com/radar/the-end-of-programming-as-we-know-it/?ref=ghuntley.com">The End of Programming as We Know It</a></li>
<li><a href="https://steve-yegge.medium.com/the-death-of-the-stubborn-developer-b5e8f78d326b">The Death of the Stubborn Developer</a></li>
<li><a href="https://sourcegraph.com/blog/the-death-of-the-junior-developer">The Death of the Junior Developer</a></li>
</ul>

<p>
Edging Toward Glory:
</p>
<ul class="org-ul">
<li><a href="https://harper.blog/2025/02/16/my-llm-codegen-workflow-atm/">My Codegen Workflow</a></li>
<li><a href="https://simonwillison.net/2025/Mar/11/using-llms-for-code/">Here's how I use LLMs to help me write code</a></li>
</ul>

<p>
Tired:
</p>
<ul class="org-ul">
<li><a href="https://developers.google.com/machine-learning/resources/prompt-eng">Prompt Engineering v2 - Google</a></li>
<li><a href="https://ai.google.dev/gemini-api/docs/prompting-strategies">Prompt Design Strategies - Google</a></li>
<li><a href="https://platform.openai.com/docs/guides/prompt-engineering">Prompt Engineering - OpenAI</a></li>
<li><a href="https://github.com/VILA-Lab/ATLAS/blob/main/data/README.md">26 Prompt Principles</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgdb46790" class="outline-2">
<h2 id="orgdb46790"><a href="https://app.codecrafters.io/catalog">April - Build Your Own X</a></h2>
<div class="outline-text-2" id="text-orgdb46790">
</div>
<div id="outline-container-orgb83e2c8" class="outline-3">
<h3 id="orgb83e2c8">Abstract</h3>
<div class="outline-text-3" id="text-orgb83e2c8">
<p>
Use AI prompting to build a system. Some options:
</p>
<ul class="org-ul">
<li><a href="https://app.codecrafters.io/courses/kafka/overview">Kafka</a></li>
<li><a href="https://app.codecrafters.io/courses/http-server/overview">HTTP Server</a></li>
<li><a href="https://app.codecrafters.io/courses/interpreter/overview">Interpreter</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc5fc07e" class="outline-3">
<h3 id="orgc5fc07e">Summary Review</h3>
<div class="outline-text-3" id="text-orgc5fc07e">
<p>
This was a follow up to the AI Prompting Course. After we had learned how to prompt AIs this was a chance to put it into practice.
</p>

<p>
I tried doing the Kafka course, but it quickly became about implementing the Kafka API rather than building the conceptual underpinnings of Kafka, which would've been much more interesting. One of the other members did the HTTP Server in Kotlin and it looked like a better course. Also, HTTP is a simpler protocol and there are a lot of examples to draw on.
</p>
</div>
</div>
</div>
<div id="outline-container-org6fe4aa7" class="outline-2">
<h2 id="org6fe4aa7"><a href="https://www.amazon.com/Algorithm-Design-Manual-Computer-Science/dp/3030542580">May - The Algorithm Design Manual</a></h2>
<div class="outline-text-2" id="text-org6fe4aa7">
</div>
<div id="outline-container-org51241b3" class="outline-3">
<h3 id="org51241b3">Abstract</h3>
<div class="outline-text-3" id="text-org51241b3">
<p>
A widely recommended algorithms book that aims to be more accessible than a standard encyclopedia. The first half focuses on "war stories" and practical application, while the second half serves as a reference catalog for algorithms and data structures.
</p>
</div>
</div>
<div id="outline-container-orgc8ae4dd" class="outline-3">
<h3 id="orgc8ae4dd">Summary Review</h3>
<div class="outline-text-3" id="text-orgc8ae4dd">
<p>
This was a very dense book but not too math heavy. We read the first part and did some of the questions at the end of each chapter. I found myself wondering when we would use some of the algorithms discussed in the book, even without going into the second half, which is very much a reference. I think it's good to have an exposure to some of these less-common algorithms, but it's hard to know when and how to apply them. Knowing that an algorithm exists is the first step, knowing when to apply it is even more important. Even if we don't know how to <span class="underline">implement</span> it, knowing it exists is helpful. AI should be able to write the implementation, but may not recognize when an algorithm should be used.
</p>
</div>
</div>
</div>
<div id="outline-container-org059cd8a" class="outline-2">
<h2 id="org059cd8a"><a href="https://www.amazon.com/Why-Machines-Learn-Elegant-Behind/dp/0593185749">Aug - Why Machines Learn</a></h2>
<div class="outline-text-2" id="text-org059cd8a">
</div>
<div id="outline-container-org631cb94" class="outline-3">
<h3 id="org631cb94">Abstract</h3>
<div class="outline-text-3" id="text-org631cb94">
<p>
A narrative explanation of the mathematics behind machine learning, covering the history of the field and its pioneering researchers. It aims to make the underlying math accessible to a broader audience.
</p>
</div>
</div>
<div id="outline-container-orge9696f9" class="outline-3">
<h3 id="orge9696f9">Summary Review</h3>
<div class="outline-text-3" id="text-orge9696f9">
<p>
I really enjoyed this book, though it focused more on machine learning and early neural network contributions and little on modern LLMs. Despite being published in mid-2024 I would've like more details on modern neural nets, transformers and attention, all discovered well before the publish date (2015-2020). The last chapter/Epilogue discusses LLMs, but it felt like it was thrown in late as the book went to publishing.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc019db6" class="outline-2">
<h2 id="orgc019db6"><a href="https://www.amazon.com/Philosophy-Software-Design-2nd/dp/173210221X">Oct - A Philosophy of Software Design, 2nd Edition</a></h2>
<div class="outline-text-2" id="text-orgc019db6">
</div>
<div id="outline-container-orgdc8d3cd" class="outline-3">
<h3 id="orgdc8d3cd">Abstract</h3>
<div class="outline-text-3" id="text-orgdc8d3cd">
<p>
This book explores the core challenge of software design: managing complexity. It advocates for breaking down systems into manageable, deep modules and provides principles to reduce complexity and improve maintainability.
</p>
</div>
</div>
<div id="outline-container-orgc57c5b4" class="outline-3">
<h3 id="orgc57c5b4">Summary Review</h3>
<div class="outline-text-3" id="text-orgc57c5b4">
<p>
I took a lot of notes for this book and had a lot of thoughts about software design. Generally I agreed with the author and most of his suggestions made sense, especially his treatment of comments. It encouraged me to improve my code comments. All of this is taken with a grain of salt with AIs though. If I'm not writing the code anymore, will I go back and add comments? Why won't I just tell the AI to do it. This ties back to "The End of Programming as We Know it", maybe we won't be thinking about programming at this level much anymore. Having read books from the early microcomputer era "Soul of a New Machine" I can certainly say that there's a lot of things that programmings in those days thought about that I don't think about anymore. Is low-level software design going that way too?
</p>
</div>
</div>
</div>
<div id="outline-container-org4251081" class="outline-2">
<h2 id="org4251081">Conclusion</h2>
<div class="outline-text-2" id="text-org4251081">
<p>
Looking back at 2025, it’s clear that while the fundamentals of software engineering (algorithms, design, career growth) remain important, our interaction with them has fundamentally shifted. We spent as much time learning how to delegate to machines (AI) as we did learning the machines themselves. In 2026, we're planning to continue down this path, diving deeper into agentic workflows and how they will reshape the role of the software engineer.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-01-10</p>
<p class="author">Author: Ben</p>
</div>
</body>
</html>
